INSERT INTO algo_tag (algo_id, tag_id) VALUES
-- Быстрая сортировка (id=1)
(1, 1),  -- сортировка
(1, 4),  -- рекурсия

-- Сортировка пузырьком (id=2)
(2, 1),  -- сортировка

-- Бинарный поиск (id=3)
(3, 2),  -- поиск
(3, 4),  -- рекурсия

-- Хеш-таблица (id=4)
(4, 3),  -- структуры данных
(4, 10), -- хеш-таблицы

-- Двоичное дерево поиска (id=5)
(5, 3),  -- структуры данных
(5, 2),  -- поиск
(5, 9),  -- деревья
(5, 4),  -- рекурсия

-- Сортировка слиянием (id=6)
(6, 1),  -- сортировка
(6, 4),  -- рекурсия

-- Линейный поиск (id=7)
(7, 2),  -- поиск

-- Стек (id=8)
(8, 3),  -- структуры данных
(8, 8),  -- линейные структуры

-- Очередь (id=9)
(9, 3),  -- структуры данных
(9, 8),  -- линейные структуры

-- Граф (BFS) (id=10)
(10, 3), -- структуры данных
(10, 2), -- поиск
(10, 5), -- графы

-- Поиск в глубину (DFS) (id=11)
(11, 3), -- структуры данных
(11, 2), -- поиск
(11, 5), -- графы
(11, 4), -- рекурсия

-- Сортировка выбором (id=12)
(12, 1), -- сортировка

-- Пирамидальная сортировка (id=13)
(13, 1), -- сортировка

-- Алгоритм Дейкстры (id=14)
(14, 5), -- графы
(14, 7), -- жадные алгоритмы

-- Алгоритм Флойда (id=15)
(15, 5), -- графы
(15, 6); -- динамическое программирование