-- =====================================================
-- ТЕГИ
-- =====================================================
INSERT INTO tag (id, name) VALUES
    (1, 'сортировка'),
    (2, 'поиск'),
    (3, 'структуры данных'),
    (4, 'рекурсия'),
    (5, 'графы'),
    (6, 'динамическое программирование'),
    (7, 'жадные алгоритмы'),
    (8, 'линейные структуры'),
    (9, 'деревья'),
    (10, 'хеш-таблицы'),
    (11, 'строки'),
    (12, 'математика'),
    (13, 'оптимизация'),
    (14, 'вероятностный'),
    (15, 'комбинаторика'),
    (16, 'потоки'),
    (17, 'сжатие'),
    (18, 'параллельные'),
    (19, 'геометрия'),
    (20, 'игры'),
    (21, 'битовые операции'),
    (22, 'системы непересекающихся множеств');